src/DataProcessors/ПанельАдминистрированияПродажиЯндексМаркет/ПанельАдминистрированияПродажиЯндексМаркет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельАдминистрированияПродажиЯндексМаркет</name>
</mdclass:DataProcessor>

src/InformationRegisters/СоответствияОбъектовМаркетплейсов/СоответствияОбъектовМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияОбъектовМаркетплейсов</name>
  <attributes>
    <name>НаименованиеОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляСхемыРаботыFBO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляСхемыРаботыFBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляСхемыРаботыDBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗаписьМаркетплейса</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыОбъектовМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторВладельцаОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект1С</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыОбъектовМаркетплейсов/ВидыОбъектовМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбъектовМаркетплейсов</name>
  <enumValues>
    <name>КатегорияТоваров</name>
  </enumValues>
  <enumValues>
    <name>АтрибутКатегорииТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеАтрибутаКатегорииТоваров</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ТипСертификата</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>Изображение</name>
  </enumValues>
  <enumValues>
    <name>КодАктивации</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/УчетныеЗаписиМаркетплейсов/УчетныеЗаписиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиМаркетплейсов</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКатегории</name>
    <type>
      <types>EnumRef.ИсточникиКатегорийДляМаркетплейса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьДанныеТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыТорговойПлощадки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыСобственные</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАккаунта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРаботы</name>
    <type>
      <types>EnumRef.СхемыРаботыТорговыхПлощадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ИмяНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНастройки</name>
    <attributes>
      <name>ИдентификаторНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>Boolean</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСсылка</name>
      <comment>Состав типов реквизита дополняется по мере необходимости</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БазовыйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЦены</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательнаяЦена</name>
    <comment>Цена заполняется, но не записывается. Используется как вспомогательная для сложных расчетов других цен</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеЦеныЗаПределамиОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриВыпускеПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриОптовойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеМеждуОрганизациями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеПродукцииДавальцу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПродаже</name>
    <comment>Устанавливается если выбраны при оптовой или розничной продажах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриРозничнойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьОтборНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Округлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатывания</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатыванияПриУменьшении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияЦены</name>
    <type>
      <types>EnumRef.СпособыЗаданияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДействияВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <comment>Общий / Индивидуальный</comment>
    <type>
      <types>EnumRef.НазначенияВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЦенуПриВводеНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанныхОтбораПоНоменклатуре</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекПараметровСпособаЗаданияЦены</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВлияющиеВидыЦен</name>
    <attributes>
      <name>ВлияющийВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОкругленияЦены</name>
    <attributes>
      <name>НижняяГраницаДиапазонаЦен</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочностьОкругления</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическоеОкругление</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорогиСрабатывания</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатывания</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатыванияПриУменьшении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Валюты</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЦены</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПанельАдминистрированияПродажиЯндексМаркет/Forms/НастройкиОбменаДанными/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
	Параметры.Свойство("ПоказыватьВыборУчетнойЗаписи", ПоказыватьВыборУчетнойЗаписи);

	Если Не ЗначениеЗаполнено(УчетнаяЗапись) И Не ПоказыватьВыборУчетнойЗаписи Тогда
		Отказ = Истина;
		Возврат; 
	Иначе
		Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда  
			ИнициализироватьФормуПоУчетнойЗаписи();
		КонецЕсли;    
		
		Если ПоказыватьВыборУчетнойЗаписи Тогда  
			Элементы.ГруппаВыборУЗ.Видимость           = Истина;
			Элементы.ФормаСохранитьНастройки.Видимость = Ложь;
			Элементы.ФормаНазад.Видимость              = Ложь;
			Элементы.ДекорацияНазад.Видимость          = Истина;
		КонецЕсли;
	КонецЕсли;  

КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьАвторизациюПриложения" Тогда 
		СрокДоступаНаЯндексДиск  = СрокДоступаНаЯндексДиск();
		ЗаполнитьДанныеАвторизацииНаЯндексДиск();
		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	ОбновитьВидимостьКнопокНазадДалее(); 
	ПроверитьОбновитьДанныеАвторизацииНаЯндексДиск();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)

	СменитьСтраницу("_Назад");

КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	СменитьСтраницу("_Далее");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеПолученияРекомендованныхСвязей(Команда)

	ПрефиксРасписания      = "ЯндексМаркет_ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет_";
	НаименованиеРасписания = ПрефиксыРегламентныхЗаданий.НайтиПоЗначению(ПрефиксРасписания).Представление;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьМаркетплейса",        УчетнаяЗапись);
	ПараметрыОткрытия.Вставить("ИмяМетаданных",                    "ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет");
	ПараметрыОткрытия.Вставить("Наименование",                     НаименованиеРасписания);
	ПараметрыОткрытия.Вставить("Префикс",                          ПрефиксРасписания);  
	ПараметрыОткрытия.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);

	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОбновлениеНастроекРегламентногоЗаданияЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеОтправкиНаМодерациюСвязейТоваров(Команда)
	
	ПрефиксРасписания      = "ЯндексМаркет_ОтправкаНаМодерациюСвязейТоваровЯндексМаркет_";
	НаименованиеРасписания = ПрефиксыРегламентныхЗаданий.НайтиПоЗначению(ПрефиксРасписания).Представление;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьМаркетплейса",        УчетнаяЗапись);
	ПараметрыОткрытия.Вставить("ИмяМетаданных",                    "ОтправкаНаМодерациюСвязейТоваровЯндексМаркет");
	ПараметрыОткрытия.Вставить("Наименование",                     НаименованиеРасписания);
	ПараметрыОткрытия.Вставить("Префикс",                          ПрефиксРасписания); 
	ПараметрыОткрытия.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);
		
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОбновлениеНастроекРегламентногоЗаданияЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеПолученияСтатусовМодерации(Команда)

	ПрефиксРасписания      = "ЯндексМаркет_ПолучениеСтатусовМодерацииТоваровЯндексМаркет_";
	НаименованиеРасписания = ПрефиксыРегламентныхЗаданий.НайтиПоЗначению(ПрефиксРасписания).Представление;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьМаркетплейса",        УчетнаяЗапись);
	ПараметрыОткрытия.Вставить("ИмяМетаданных",                    "ПолучениеСтатусовМодерацииТоваровЯндексМаркет");
	ПараметрыОткрытия.Вставить("Наименование",                     НаименованиеРасписания);
	ПараметрыОткрытия.Вставить("Префикс",                          ПрефиксРасписания);     
	ПараметрыОткрытия.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);

	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание", 
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОбновлениеНастроекРегламентногоЗаданияЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеВыгрузкиЦен(Команда)

	ПрефиксРасписания      = "ЯндексМаркет_ВыгрузкаУстановленныхЦенЯндексМаркет_";
	НаименованиеРасписания = ПрефиксыРегламентныхЗаданий.НайтиПоЗначению(ПрефиксРасписания).Представление;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьМаркетплейса",        УчетнаяЗапись);
	ПараметрыОткрытия.Вставить("ИмяМетаданных",                    "ВыгрузкаУстановленныхЦенЯндексМаркет");
	ПараметрыОткрытия.Вставить("Наименование",                     НаименованиеРасписания);
	ПараметрыОткрытия.Вставить("Префикс",                          ПрефиксРасписания);  
	ПараметрыОткрытия.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);

	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание", 
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОбновлениеНастроекРегламентногоЗаданияЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыЦен(Команда)

	ОткрытьФорму("Справочник.ВидыЦен.Форма.ФормаСписка",
		,
		ЭтотОбъект,
		Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеОбновленияЦен(Команда)

	ОткрытьФорму("Справочник.ВидыЦен.Форма.ФормаНастройкиРасписанияАвтообновленияЦен",
		,
		ЭтотОбъект,
		Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеВыгрузкиОстатковТоваров(Команда)

	ПрефиксРасписания      = "ЯндексМаркет_ВыгрузкаОстатковТоваровЯндексМаркет_";
	НаименованиеРасписания = ПрефиксыРегламентныхЗаданий.НайтиПоЗначению(ПрефиксРасписания).Представление;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьМаркетплейса",        УчетнаяЗапись);
	ПараметрыОткрытия.Вставить("ИмяМетаданных",                    "ВыгрузкаОстатковТоваровЯндексМаркет");
	ПараметрыОткрытия.Вставить("Наименование",                     НаименованиеРасписания);
	ПараметрыОткрытия.Вставить("Префикс",                          ПрефиксРасписания);  
	ПараметрыОткрытия.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);
	
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОбновлениеНастроекРегламентногоЗаданияЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЯндексДискНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ПараметрыПриложенияЯндекс, УчетнаяЗаписьМаркетплейса",ПараметрыПриложенияЯндексДиск(), УчетнаяЗапись);
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.АвторизацияПриложенияЯндекс", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	Если СохранитьНаСервере() Тогда
		Закрыть(УчетнаяЗапись);
		ОповеститьОбИзменении(УчетнаяЗапись);
		Оповестить("ЯндексМаркет_НастройкиОбменаДанными", УчетнаяЗапись);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеАвторизацииНаЯндексДиск()  
	
	ЧастиСтроки = Новый Массив;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Если СрокДоступаНаЯндексДиск < ТекущаяДатаСеанса Тогда 
		
		СостояниеАвторизацииТекст = НСтр("ru = 'Доступ не настроен.';
										|en = 'Доступ не настроен.'");
	    СостояниеАвторизации = Новый ФорматированнаяСтрока(СостояниеАвторизацииТекст,,ЦветаСтиля.ЦветОсобогоТекста);
		
	ИначеЕсли СрокДоступаНаЯндексДиск > ТекущаяДатаСеанса
			  И СрокДоступаНаЯндексДиск - 864000 < ТекущаяДатаСеанса Тогда
			  
		КоличествоДней = (НачалоДня(СрокДоступаНаЯндексДиск) - НачалоДня(ТекущаяДатаСеанса)) / (60 * 60 * 24); 

		СостояниеАвторизацииТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
									НСтр("ru = 'Доступ предоставлен до %1 (истекает через %2). Для продления авторизации воспользуйтесь командой ""Подключить Яндекс Диск"".';
										|en = 'Доступ предоставлен до %1 (истекает через %2). Для продления авторизации воспользуйтесь командой ""Подключить Яндекс Диск"".'"),
									Формат(СрокДоступаНаЯндексДиск,"ДФ=dd.MM.yyyy"),
									КоличествоДней);
		СостояниеАвторизации = Новый ФорматированнаяСтрока(СостояниеАвторизацииТекст,,ЦветаСтиля.ЦветОсобогоТекста);  	
		
	ИначеЕсли СрокДоступаНаЯндексДиск - 864000 > ТекущаяДатаСеанса Тогда
		
		СостояниеАвторизацииТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
									НСтр("ru = 'Доступ предоставлен до %1.';
										|en = 'Доступ предоставлен до %1.'"),
									Формат(СрокДоступаНаЯндексДиск,"ДФ=dd.MM.yyyy"));
		СостояниеАвторизации = Новый ФорматированнаяСтрока(СостояниеАвторизацииТекст,,ЦветаСтиля.РезультатУспехЦвет);
	КонецЕсли;
	
	ЧастиСтроки = Новый Массив;  
	ЧастиСтроки.Добавить(СостояниеАвторизации); 
	ЧастиСтроки.Добавить("
						|");
	ЧастиСтроки.Добавить(НСтр("ru = 'Авторизация на сервисе Яндекс Диск необходима для выгрузки изображений товара.';
								|en = 'Авторизация на сервисе Яндекс Диск необходима для выгрузки изображений товара.'"));
	
	Элементы.ДекорацияАвторизацияЯндексДискПодсказка1.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФормуПоУчетнойЗаписи()
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеУчетнойЗаписиЯндексМаркет = ИнтеграцияСЯндексМаркетСервер.ДанныеУчетнойЗаписиЯндексМаркет(УчетнаяЗапись);
	УстановитьПривилегированныйРежим(Ложь);
	
	Наименование          = ДанныеУчетнойЗаписиЯндексМаркет.Наименование;
	МодельРаботы          = ДанныеУчетнойЗаписиЯндексМаркет.СхемаРаботы;
	Организация           = ДанныеУчетнойЗаписиЯндексМаркет.Организация;
	ИдентификаторАккаунта = ДанныеУчетнойЗаписиЯндексМаркет.ИдентификаторАккаунта;
	ИдентификаторКабинета = ДанныеУчетнойЗаписиЯндексМаркет.ИдентификаторКабинета;
	ИдентификаторКампании = ДанныеУчетнойЗаписиЯндексМаркет.ИдентификаторМагазина;
	НомерМагазина         = ДанныеУчетнойЗаписиЯндексМаркет.ИдентификаторКлиента;
	ВключенаСинхронизация = Не ДанныеУчетнойЗаписиЯндексМаркет.НеОбновлятьДанныеТорговойПлощадки; 
    ЛогинИзХранилища         = ИнтеграцияСЯндексМаркетСервер.ДанныеАвторизацииЛогин(ИдентификаторАккаунта); 
	Если ЛогинИзХранилища <> Неопределено Тогда
		Логин = ЛогинИзХранилища; 
	КонецЕсли;	
	ДополнительнаяИнформация = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'ID кампании - %1, ID кабинета - %2';
										|en = 'ID кампании - %1, ID кабинета - %2'"),
									ИдентификаторКампании,
									ИдентификаторКабинета);

	ЦенаПродажи           = ДанныеУчетнойЗаписиЯндексМаркет.ЦенаПродажи;
	ИсточникКатегории     = ДанныеУчетнойЗаписиЯндексМаркет.ИсточникКатегории;

	ЗаполнитьСкладПоУчетнойЗаписи();
	ОбновитьВидимостьКнопокНазадДалее();

	ПараметрыВыбора = Новый Структура("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
	ДанныеВыбора    = Перечисления.СхемыРаботыТорговыхПлощадок.ПолучитьДанныеВыбора(ПараметрыВыбора);

	Для Каждого ЗначениеВыбора Из ДанныеВыбора Цикл
		Элементы.МодельРаботы.СписокВыбора.Добавить(ЗначениеВыбора.Значение, ЗначениеВыбора.Представление);
	КонецЦикла;   
	
	Элементы.ФормаСохранитьНастройки.Видимость = Истина; 
	Если ПоказыватьВыборУчетнойЗаписи Тогда 
		Элементы.ФормаНазад.Видимость     = Истина;
		Элементы.ДекорацияНазад.Видимость = Ложь;
	КонецЕсли;       
	
	СрокДоступаНаЯндексДиск  = СрокДоступаНаЯндексДиск();
	ЗаполнитьДанныеАвторизацииНаЯндексДиск(); 
		
	ЗаполнитьИнформациюПоРегламентнымЗаданиям(Истина);
	
	ПредыдущийСклад               = Склад;
	ПредыдущийИдентификаторСклада = ИдентификаторСклада;
	
КонецПроцедуры

&НаСервере
Функция СрокДоступаНаЯндексДиск()  
	
	Возврат ИнтеграцияСМаркетплейсамиСервер.ПолучитьДатуДействияДоступаЯндексДиск(УчетнаяЗапись);

КонецФункции

&НаСервере
Процедура ЗаполнитьСкладПоУчетнойЗаписи()

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторОбъектаМаркетплейса,
		|	СоответствияОбъектовМаркетплейсов.НаименованиеОбъектаМаркетплейса КАК НаименованиеОбъектаМаркетплейса,
		|	СоответствияОбъектовМаркетплейсов.Объект1С КАК Склад
		|ИЗ
		|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
		|ГДЕ
		|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
		|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)";

	Запрос.Параметры.Вставить("УчетнаяЗапись",          УчетнаяЗапись);
	Запрос.УстановитьПараметр("ВидОбъектаМаркетплейса", Перечисления.ВидыОбъектовМаркетплейсов.Склад);

	ВыборкаДанных = Запрос.Выполнить().Выбрать();
		
	Пока ВыборкаДанных.Следующий() Цикл
		ИдентификаторСклада = ВыборкаДанных.ИдентификаторОбъектаМаркетплейса;
		Склад               = ВыборкаДанных.Склад;
	КонецЦикла;

КонецПроцедуры
	
&НаСервере
Функция ОбновитьКлючиДоступаПоУчетнойЗаписиНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение            = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания  = НСтр("ru = 'Яндекс Диск. Обновление данных авторизации.';
															|en = 'Яндекс Диск. Обновление данных авторизации.'");
	ПараметрыВыполнения.ЗапуститьВФоне               = Истина;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;
	
	ИмяМетода = "ИнтеграцияСМаркетплейсамиСервер.ОбновитьКлючиДоступаПоУчетнойЗаписи";
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		ИмяМетода,
		УчетнаяЗапись);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьОбновитьДанныеАвторизацииНаЯндексДиск()
	
	ТекущаяДатаСеансаНаСервере = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Если СрокДоступаНаЯндексДиск > ТекущаяДатаСеансаНаСервере
		И СрокДоступаНаЯндексДиск - 864000 < ТекущаяДатаСеансаНаСервере Тогда 
		
		ДлительнаяОперация    = ОбновитьКлючиДоступаПоУчетнойЗаписиНаСервере();
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьКлючиДоступаПоУчетнойЗаписиЗавершениеФоновогоЗадания", ЭтотОбъект, УчетнаяЗапись);
		
		Если ДлительнаяОперация.Статус = "Выполнено" Тогда
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ДлительнаяОперация);
			
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания             = Истина;
			ПараметрыОжидания.ТекстСообщения                   = НСтр("ru = 'Обновление данных авторизации для доступа на Яндекс Диск.';
																		|en = 'Обновление данных авторизации для доступа на Яндекс Диск.'");
			ПараметрыОжидания.ОповещениеПользователя.Показать  = Истина;
			ПараметрыОжидания.ОповещениеПользователя.Текст     = НСтр("ru = 'Получение данных';
																		|en = 'Получение данных'");
			ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru = 'Завершено Обновление данных авторизации для доступа на Яндекс Диск.';
																		|en = 'Завершено Обновление данных авторизации для доступа на Яндекс Диск.'");
			ПараметрыОжидания.ОповещениеПользователя.Картинка  = БиблиотекаКартинок.ЛоготипЯндексМаркет;
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		КонецЕсли;	
	КонецЕсли;     
	
КонецПроцедуры  

&НаСервере
Функция ОбновитьДанныеУчетнойЗаписи()  
	
	Результат = Ложь;

	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.УчетныеЗаписиМаркетплейсов");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", УчетнаяЗапись);
		БлокировкаДанных.Заблокировать();

		УчетнаяЗаписьОбъект                                   = УчетнаяЗапись.ПолучитьОбъект();
		УчетнаяЗаписьОбъект.Наименование                      = Наименование;
		УчетнаяЗаписьОбъект.Организация                       = Организация;
		УчетнаяЗаписьОбъект.ИсточникКатегории                 = ИсточникКатегории;
		УчетнаяЗаписьОбъект.ИдентификаторАккаунта             = ИдентификаторАккаунта;
		УчетнаяЗаписьОбъект.ИдентификаторКабинета             = ИдентификаторКабинета;
		УчетнаяЗаписьОбъект.ИдентификаторМагазина             = ИдентификаторКампании;
		УчетнаяЗаписьОбъект.ИдентификаторКлиента              = НомерМагазина;
		УчетнаяЗаписьОбъект.СхемаРаботы                       = МодельРаботы;
		УчетнаяЗаписьОбъект.НеОбновлятьДанныеТорговойПлощадки = Не ВключенаСинхронизация;
	
		ТабличнаяЧастьВидовЦен = УчетнаяЗаписьОбъект.ВидыЦен; 
		СтрЦенаПродажи         = НСтр("ru = 'Цена продажи';
										|en = 'Selling price'");
		СтрокаЦеныПродажи      = ТабличнаяЧастьВидовЦен.Найти(СтрЦенаПродажи, "ИмяНастройки");
	
		Если СтрокаЦеныПродажи = Неопределено Тогда
			СтрокаЦеныПродажи              = ТабличнаяЧастьВидовЦен.Добавить();
			СтрокаЦеныПродажи.ИмяНастройки = СтрЦенаПродажи;
			СтрокаЦеныПродажи.ВидЦены      = ЦенаПродажи;
		Иначе
			СтрокаЦеныПродажи.ВидЦены = ЦенаПродажи;
		КонецЕсли;
	
		УчетнаяЗаписьОбъект.Записать();
		
		ЗафиксироватьТранзакцию(); 
		
		Результат = Истина;
		
	Исключение
		ОтменитьТранзакцию();  
		СообщениеПользователю = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());  
		СтрокаПоиска = НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных.';
							|en = 'The user has insufficient rights to perform operations with the database.'");
		Если СтрНайти(СообщениеПользователю,СтрокаПоиска)>0 Тогда 
			СообщениеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных.Проверьте доступность работы с организацией ""%1"" в настройках профиля доступа.';
																								|en = 'The user has insufficient rights to perform operations with the database. Check whether it is possible to operate with the ""%1"" company in the access profile settings.'"),Организация);
	
		КонецЕсли;    
		
		ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСоответствиеСкладов()

	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СоответствияОбъектовМаркетплейсов");
		ЭлементБлокировкиДанных.УстановитьЗначение("УчетнаяЗаписьМаркетплейса", УчетнаяЗапись);
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидОбъектаМаркетплейса",    Перечисления.ВидыОбъектовМаркетплейсов.Склад);
		БлокировкаДанных.Заблокировать();

		НаборЗаписей = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗаписьМаркетплейса.Установить(УчетнаяЗапись);
		НаборЗаписей.Отбор.ВидОбъектаМаркетплейса.Установить(Перечисления.ВидыОбъектовМаркетплейсов.Склад);
		НаборЗаписей.Прочитать();
	
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
		Иначе
			Запись = НаборЗаписей.Добавить();
		КонецЕсли;
	
		Запись.УчетнаяЗаписьМаркетплейса        = УчетнаяЗапись;
		Запись.ВидОбъектаМаркетплейса           = ПредопределенноеЗначение("Перечисление.ВидыОбъектовМаркетплейсов.Склад");
		Запись.ИдентификаторОбъектаМаркетплейса = ИдентификаторСклада;
		Запись.Объект1С                         = Склад;
		Запись.НаименованиеОбъектаМаркетплейса  = СокрЛП(Склад);
		Запись.ДатаАктуальности                 = ТекущаяДатаСеанса();
	
		НаборЗаписей.Записать();
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция СоответствиеПереключенияСтраниц()

	СоответствиеПереключенияСтраниц = Новый Соответствие;
	
	СоответствиеПереключенияСтраниц.Вставить("ДанныеМагазина_Далее",                   "СтраницаСопоставлениеДанных");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаСопоставлениеДанных_Назад",      "ДанныеМагазина");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаСопоставлениеДанных_Далее",      "СтраницаНастройкиОбновленияЦен");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаНастройкиОбновленияЦен_Далее",   "СтраницаНастройкиОбменаОстатками");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаНастройкиОбновленияЦен_Назад",   "СтраницаСопоставлениеДанных");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаНастройкиОбменаОстатками_Назад", "СтраницаНастройкиОбновленияЦен");

	Возврат СоответствиеПереключенияСтраниц;

КонецФункции

&НаКлиенте
Процедура СменитьСтраницу(Постфикс)
	
	ОчиститьСообщения();
	
	Если Элементы.ГруппаВыбораУчетнойЗаписи.ТекущаяСтраница = Элементы.ГруппаВыбораУчетнойЗаписи.ПодчиненныеЭлементы.ГруппаВыборУЗ
		И Постфикс = "_Далее" Тогда       
		
		Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда  
			ТекстОшибки = 	НСтр("ru = 'Выберите магазин';
									|en = 'Select a store'",);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Иначе	
			ИнициализироватьФормуПоУчетнойЗаписи();
			Элементы.ГруппаВыбораУчетнойЗаписи.ТекущаяСтраница = Элементы.ГруппаВыбораУчетнойЗаписи.ПодчиненныеЭлементы.ГруппаБезВыбораУЗ; 
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ДанныеМагазина
		И Постфикс = "_Назад" Тогда

		Элементы.ГруппаВыбораУчетнойЗаписи.ТекущаяСтраница = Элементы.ГруппаВыбораУчетнойЗаписи.ПодчиненныеЭлементы.ГруппаВыборУЗ; 	
		Элементы.ФормаСохранитьНастройки.Видимость = Ложь;
		Элементы.ФормаНазад.Видимость              = Ложь;
		Элементы.ДекорацияНазад.Видимость          = Истина;
		
	Иначе        
		
		СоответствиеПереключенияСтраниц   = СоответствиеПереключенияСтраниц();
		Элементы.Страницы.ТекущаяСтраница = Элементы[СоответствиеПереключенияСтраниц[Элементы.Страницы.ТекущаяСтраница.Имя + Постфикс]];
		ОбновитьВидимостьКнопокНазадДалее(); 
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте  
Процедура ОбновитьКлючиДоступаПоУчетнойЗаписиЗавершениеФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	СрокДоступаНаЯндексДиск  = СрокДоступаНаЯндексДиск();
	ЗаполнитьДанныеАвторизацииНаЯндексДиск();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеНастроекРегламентногоЗаданияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ЗаполнитьИнформациюПоРегламентнымЗаданиям();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоРегламентнымЗаданиям(ЗаполнитьПрефиксы = Ложь)

	СписокОбновляемыхЭлементов = Новый СписокЗначений;
	СписокОбновляемыхЭлементов.Добавить("ИнформацияОРасписанииВыгрузкиТоварногоКаталога", "ЯндексМаркет_ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет_");
	СписокОбновляемыхЭлементов.Добавить("ИнформацияОРасписанииОтправкиНаМодерациюСвязейТоваров", "ЯндексМаркет_ОтправкаНаМодерациюСвязейТоваровЯндексМаркет_");
	СписокОбновляемыхЭлементов.Добавить("ИнформацияОРасписанииПолученияСтатусовМодерации", "ЯндексМаркет_ПолучениеСтатусовМодерацииТоваровЯндексМаркет_");
	СписокОбновляемыхЭлементов.Добавить("ИнформацияОРасписанииВыгрузкиЦен", "ЯндексМаркет_ВыгрузкаУстановленныхЦенЯндексМаркет_");
	СписокОбновляемыхЭлементов.Добавить("ИнформацияОРасписанииВыгрузкиОстатков", "ЯндексМаркет_ВыгрузкаОстатковТоваровЯндексМаркет_");
    
    УстановитьПривилегированныйРежим(Истина);
	ПрефиксыРегламентныхЗаданий          = ИнтеграцияСЯндексМаркетСервер.ПрефиксыРегламентныхЗаданий();  
	СостояниеРегламентныхЗаданийМагазина = ИнтеграцияСЯндексМаркетСервер.ПолучитьСостоянияРегламентныхЗаданийМагазина(УчетнаяЗапись, ПрефиксыРегламентныхЗаданий);
	ОтключенныеРегламентныеЗадания       = СостояниеРегламентныхЗаданийМагазина.ОтключенныеРегламентныеЗадания;
    УстановитьПривилегированныйРежим(Ложь);

	Для Каждого ОбновляемыйЭлемент Из СписокОбновляемыхЭлементов Цикл
		ЭлементОбновления = Элементы[ОбновляемыйЭлемент.Значение];
		ЭлементОбновления.Видимость = (ОтключенныеРегламентныеЗадания.НайтиПоЗначению(ОбновляемыйЭлемент.Представление) <> Неопределено);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыПриложенияЯндексДиск()

	Возврат ИнтеграцияСМаркетплейсамиСервер.ПараметрыПриложенияЯндексДиск();

КонецФункции

&НаСервере
Процедура ОбновитьВидимостьКнопокНазадДалее()

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ДанныеМагазина Тогда  
		Если Не ПоказыватьВыборУчетнойЗаписи Тогда
			Элементы.ФормаНазад.Видимость     = Ложь;
			Элементы.ДекорацияНазад.Видимость = Истина;
		Иначе   
			Элементы.ФормаНазад.Видимость     = Истина;
			Элементы.ДекорацияНазад.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ФормаНазад.Видимость     = Истина;
		Элементы.ДекорацияНазад.Видимость = Ложь;
	КонецЕсли;

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СтраницаНастройкиОбменаОстатками
			И (МодельРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.FBS
				Или МодельРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.Express) Тогда
		Элементы.ФормаДалее.Видимость                      = Ложь;
		Элементы.ФормаДалее.КнопкаПоУмолчанию              = Ложь;
		Элементы.ФормаСохранитьНастройки.КнопкаПоУмолчанию = Истина;
		ПродажиСервер.УстановитьРежимВыбораГруппЭлементовСклада(Элементы.Склад);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СтраницаНастройкиОбновленияЦен
				И Не (МодельРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.FBS
					Или МодельРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.Express) Тогда
		Элементы.ФормаДалее.Видимость                      = Ложь;
		Элементы.ФормаДалее.КнопкаПоУмолчанию              = Ложь;
		Элементы.ФормаСохранитьНастройки.КнопкаПоУмолчанию = Истина;
		
	Иначе
		Элементы.ФормаДалее.Видимость         = Истина;
		Элементы.ФормаДалее.КнопкаПоУмолчанию = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере()   
	
	Результат = Ложь;

	Попытка
		Результат = ОбновитьДанныеУчетнойЗаписи();
		
		Если МодельРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.FBS
				Или МодельРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.Express Тогда
			ЗаписатьСоответствиеСкладов();
			
			Если Склад <> ПредыдущийСклад
					Или ИдентификаторСклада <> ПредыдущийИдентификаторСклада Тогда
				РегистрыСведений.ОстаткиТоваровМаркетплейсов.ОчиститьЗаписиПоСкладу(УчетнаяЗапись, Неопределено);
			КонецЕсли;
		КонецЕсли;

	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При сохранении настроек учетной записи ""%1"" возникли ошибки: %2';
				|en = 'Errors occurred while saving the settings of account ""%1"": %2'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УчетнаяЗапись,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ИдентификаторКлиентаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	ПолучитьИзБуфераОбменаНомерМагазина();

КонецПроцедуры  

&НаКлиенте
Асинх Процедура ПолучитьИзБуфераОбменаНомерМагазина() 
	
	НомерМагазина = Ждать СодержимоеБуфераОбмена();	

КонецПроцедуры

&НаКлиенте
Асинх Функция СодержимоеБуфераОбмена()
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Если Ждать СредстваБуфераОбмена.СодержитДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст) Тогда
			Возврат Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст);
		КонецЕсли;
	КонецЕсли;   
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
